tutorials/heatTransfer/buoyantBoussinesqSimpleFoam/iglooWithFridges/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    ground
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    igloo_region0
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    twoFridgeFreezers_seal_0
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    twoFridgeFreezers_herring_1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
